# SERIES

In [24]:
import pandas as pd

## Topic: Series Structure

In [25]:
import pandas as pd
import seaborn as sns

# Load dataset
df = sns.load_dataset('titanic')
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

### 1. Basic Series Properties

In [26]:
df['age'].index

RangeIndex(start=0, stop=891, step=1)

In [27]:
df['age'].name

'age'

In [28]:
df['age'].dtype

dtype('float64')

In [29]:
df['age'].dtypes

dtype('float64')

In [30]:
df['age'].shape

(891,)

In [31]:
df['age'].ndim

1

In [32]:
df['age'].size

891

In [33]:
df['age'].values[:5]

array([22., 38., 26., 35., 35.])

In [34]:
df['age'].array[:5]

<NumpyExtensionArray>
[np.float64(22.0), np.float64(38.0), np.float64(26.0), np.float64(35.0),
 np.float64(35.0)]
Length: 5, dtype: float64

### 2. Boolean Checks

In [35]:
df['age'].empty

False

In [36]:
df['age'].hasnans

True

In [37]:
df['age'].isna().sum()

np.int64(177)

### 3. Advanced Attributes (Less Common)

In [38]:
df['age'].flags

In [39]:
df['age'].set_flags(allows_duplicate_labels=False)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [40]:
df['age'].attrs

{}

## Topic: Access & Selection

### 1. Label-Based & Positional Access

In [41]:

df['age'].at[0]

np.float64(22.0)

In [42]:
df['age'].iat[10]

np.float64(4.0)

In [43]:
df['age'].iloc[10:]

10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 881, dtype: float64

In [44]:
df.loc[0, 'age']

np.float64(22.0)

In [45]:
print(df.loc[[0,2,15,6,10,11], 'age'])

0     22.0
2     26.0
15    55.0
6     54.0
10     4.0
11    58.0
Name: age, dtype: float64

In [46]:
df.loc[0, ['age', 'fare', 'sex']]

age     22.0
fare    7.25
sex     male
Name: 0, dtype: object

In [47]:
df.loc[[1, 3, 5], ['sex', 'age', 'fare']]

      sex   age     fare
1  female  38.0  71.2833
3  female  35.0  53.1000
5    male   NaN   8.4583

In [48]:
df.loc[0:4, 'age':'fare']

    age  sibsp  parch     fare
0  22.0      1      0   7.2500
1  38.0      1      0  71.2833
2  26.0      0      0   7.9250
3  35.0      1      0  53.1000
4  35.0      0      0   8.0500

### 2. Value Retrieval & Conversion

In [49]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [50]:
df['age'].get(0)

np.float64(22.0)

In [51]:
df['fare'].get(2)

np.float64(7.925)

In [52]:
df['age'].iloc[[0]].item()

22.0

In [53]:
df['fare'].array[:10]

<NumpyExtensionArray>
[   np.float64(7.25), np.float64(71.2833),   np.float64(7.925),
    np.float64(53.1),    np.float64(8.05),  np.float64(8.4583),
 np.float64(51.8625),  np.float64(21.075), np.float64(11.1333),
 np.float64(30.0708)]
Length: 10, dtype: float64

In [54]:
df['age'].items

<bound method Series.items of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64>

In [55]:
for i, val in df['age'].items():
    print(i, val)
    if i >= 4:
        break

0 22.0
1 38.0
2 26.0
3 35.0
4 35.0

In [56]:
df['age'].iter()

AttributeError: 'Series' object has no attribute 'iter'

### 3. Data Removal & Iteration

### 4. Advanced Selection

In [58]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [60]:
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [62]:
df['age'].add(100)

0      122.0
1      138.0
2      126.0
3      135.0
4      135.0
       ...
886    127.0
887    119.0
888      NaN
889    126.0
890    132.0
Name: age, Length: 891, dtype: float64

In [63]:
df['age'].div(5)

0      4.4
1      7.6
2      5.2
3      7.0
4      7.0
      ...
886    5.4
887    3.8
888    NaN
889    5.2
890    6.4
Name: age, Length: 891, dtype: float64

In [64]:
df['age'].truediv(5)

0      4.4
1      7.6
2      5.2
3      7.0
4      7.0
      ...
886    5.4
887    3.8
888    NaN
889    5.2
890    6.4
Name: age, Length: 891, dtype: float64

In [65]:
df['age'].radd(100)

0      122.0
1      138.0
2      126.0
3      135.0
4      135.0
       ...
886    127.0
887    119.0
888      NaN
889    126.0
890    132.0
Name: age, Length: 891, dtype: float64

In [66]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [68]:
print(df['age'].sub(10))
print(df['age'].rsub(10))

0      12.0
1      28.0
2      16.0
3      25.0
4      25.0
       ...
886    17.0
887     9.0
888     NaN
889    16.0
890    22.0
Name: age, Length: 891, dtype: float64
0     -12.0
1     -28.0
2     -16.0
3     -25.0
4     -25.0
       ...
886   -17.0
887    -9.0
888     NaN
889   -16.0
890   -22.0
Name: age, Length: 891, dtype: float64

In [76]:
a = df[df['age'].eq(12)]
a

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
125,1,3,male,12.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False